Repository: amb/ludum-dare-50
Catalog: locale/*.po
Languages: fi

source: Engage
fi: Suorita

source: Faster movement
fi: Vikkelämpi

source: Bigger area
fi: Isompi alue

source: Increase damage
fi: Lisää vahinkoa

source: Knockback force
fi: Iskun voima

source: Lower cast time
fi: Nopeampi tahti

source: More projectiles
fi: Lisää ammuksia

source: Longer duration
fi: Pidempi kesto

source: Pickup range
fi: Ulottuvuus

source: Health pool
fi: Elinvoima

source: Thicker armor
fi: Panssarin paksuus

source: Level
fi: Taso

source: Exp
fi: Kokemus

source: Time
fi: Aika
